Revit 2025 API
SubRegionFailures Properties
The BuiltInFailures.SubRegionFailures type exposes the following members.
Properties
Name | Description
CreateSubRegionFailed |  Create sub-division failed.
NoHostForToposolidSubregion |  This sub-division now does not appear to overlap any Toposolid with an appropriate Phase and Design Option.
SubDivisionPhaseMismatch |  Sub-division must have the same Phase Created parameter and Phase Demolished parameter as the host Toposolid. Sub-division phase will be set to match the Toposolid.
Top
See Also
Reference
BuiltInFailures.SubRegionFailures Class
Autodesk.Revit.DB Namespace